Duet3D/Duet3Expansion/src/atmel/SAME51_DFP/1.1.129/edc/ATSAME51J19A.PIC
      <edc:AdjustPoint edc:_addr="0x4100A00E" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x4100A010" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SWTRIGCTRL" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="SWTRIG0" edc:desc="Channel 0 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG1" edc:desc="Channel 1 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG2" edc:desc="Channel 2 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG3" edc:desc="Channel 3 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG4" edc:desc="Channel 4 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG5" edc:desc="Channel 5 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG6" edc:desc="Channel 6 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG7" edc:desc="Channel 7 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG8" edc:desc="Channel 8 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG9" edc:desc="Channel 9 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG10" edc:desc="Channel 10 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG11" edc:desc="Channel 11 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG12" edc:desc="Channel 12 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG13" edc:desc="Channel 13 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG14" edc:desc="Channel 14 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG15" edc:desc="Channel 15 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG16" edc:desc="Channel 16 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG17" edc:desc="Channel 17 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG18" edc:desc="Channel 18 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG19" edc:desc="Channel 19 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG20" edc:desc="Channel 20 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG21" edc:desc="Channel 21 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG22" edc:desc="Channel 22 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG23" edc:desc="Channel 23 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG24" edc:desc="Channel 24 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG25" edc:desc="Channel 25 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG26" edc:desc="Channel 26 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG27" edc:desc="Channel 27 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG28" edc:desc="Channel 28 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG29" edc:desc="Channel 29 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG30" edc:desc="Channel 30 Software Trigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG31" edc:desc="Channel 31 Software Trigger" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A014" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRICTRL0" edc:mclr="01000000010000000100000001000000" edc:nzwidth="0x20" edc:por="01000000010000000100000001000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="LVLPRI0" edc:desc="Level 0 Channel Priority Number" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="QOS0" edc:desc="Level 0 Quality of Service" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="REGULAR" edc:desc="Regular delivery" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SHORTAGE" edc:desc="Bandwidth shortage" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SENSITIVE" edc:desc="Latency sensitive" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CRITICAL" edc:desc="Latency critical" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRLVLEN0" edc:desc="Level 0 Round-Robin Scheduling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLPRI1" edc:desc="Level 1 Channel Priority Number" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="QOS1" edc:desc="Level 1 Quality of Service" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="REGULAR" edc:desc="Regular delivery" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SHORTAGE" edc:desc="Bandwidth shortage" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SENSITIVE" edc:desc="Latency sensitive" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CRITICAL" edc:desc="Latency critical" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRLVLEN1" edc:desc="Level 1 Round-Robin Scheduling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLPRI2" edc:desc="Level 2 Channel Priority Number" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="QOS2" edc:desc="Level 2 Quality of Service" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="REGULAR" edc:desc="Regular delivery" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SHORTAGE" edc:desc="Bandwidth shortage" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SENSITIVE" edc:desc="Latency sensitive" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CRITICAL" edc:desc="Latency critical" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRLVLEN2" edc:desc="Level 2 Round-Robin Scheduling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLPRI3" edc:desc="Level 3 Channel Priority Number" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="QOS3" edc:desc="Level 3 Quality of Service" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="REGULAR" edc:desc="Regular delivery" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SHORTAGE" edc:desc="Bandwidth shortage" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SENSITIVE" edc:desc="Latency sensitive" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CRITICAL" edc:desc="Latency critical" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRLVLEN3" edc:desc="Level 3 Round-Robin Scheduling Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100A018" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4100A020" edc:access="nnnn-nnn---nnnnn" edc:cname="INTPEND" edc:impl="0xF71F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="ID" edc:desc="Channel ID" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TERR" edc:desc="Transfer Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCMPL" edc:desc="Transfer Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:desc="Channel Suspend" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERR" edc:desc="CRC Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:desc="Fetch Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:desc="Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEND" edc:desc="Pending" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100A022" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x4100A024" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="INTSTATUS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CHINT0" edc:desc="Channel 0 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT1" edc:desc="Channel 1 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT2" edc:desc="Channel 2 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT3" edc:desc="Channel 3 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT4" edc:desc="Channel 4 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT5" edc:desc="Channel 5 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT6" edc:desc="Channel 6 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT7" edc:desc="Channel 7 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT8" edc:desc="Channel 8 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT9" edc:desc="Channel 9 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT10" edc:desc="Channel 10 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT11" edc:desc="Channel 11 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT12" edc:desc="Channel 12 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT13" edc:desc="Channel 13 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT14" edc:desc="Channel 14 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT15" edc:desc="Channel 15 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT16" edc:desc="Channel 16 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT17" edc:desc="Channel 17 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT18" edc:desc="Channel 18 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT19" edc:desc="Channel 19 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT20" edc:desc="Channel 20 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT21" edc:desc="Channel 21 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT22" edc:desc="Channel 22 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT23" edc:desc="Channel 23 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT24" edc:desc="Channel 24 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT25" edc:desc="Channel 25 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT26" edc:desc="Channel 26 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT27" edc:desc="Channel 27 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT28" edc:desc="Channel 28 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT29" edc:desc="Channel 29 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT30" edc:desc="Channel 30 Pending Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHINT31" edc:desc="Channel 31 Pending Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A028" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="BUSYCH" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="BUSYCH0" edc:desc="Busy Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH1" edc:desc="Busy Channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH2" edc:desc="Busy Channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH3" edc:desc="Busy Channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH4" edc:desc="Busy Channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH5" edc:desc="Busy Channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH6" edc:desc="Busy Channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH7" edc:desc="Busy Channel 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH8" edc:desc="Busy Channel 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH9" edc:desc="Busy Channel 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH10" edc:desc="Busy Channel 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH11" edc:desc="Busy Channel 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH12" edc:desc="Busy Channel 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH13" edc:desc="Busy Channel 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH14" edc:desc="Busy Channel 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH15" edc:desc="Busy Channel 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH16" edc:desc="Busy Channel 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH17" edc:desc="Busy Channel 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH18" edc:desc="Busy Channel 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH19" edc:desc="Busy Channel 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH20" edc:desc="Busy Channel 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH21" edc:desc="Busy Channel 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH22" edc:desc="Busy Channel 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH23" edc:desc="Busy Channel 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH24" edc:desc="Busy Channel 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH25" edc:desc="Busy Channel 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH26" edc:desc="Busy Channel 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH27" edc:desc="Busy Channel 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH28" edc:desc="Busy Channel 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH29" edc:desc="Busy Channel 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH30" edc:desc="Busy Channel 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH31" edc:desc="Busy Channel 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
